## Assignment - 3

##### Problem Statement 1: 
#### In a survey conducted by a non-banking financial company, a sample of 200 customers yielded that x of them were highly satisfied with the timely disbursal of their loans.

Write a Python code to perform the following operations:

1.Read an integer input thatspecifies the number of highly satisfied customers

2.Calculate an approximate 90% confidence interval for the proportion of the loan customers who are highly satisfied with disbursal time

•Find out the Margin of Error using scipy.stats.norm.ppf

•Calculate and print the confidence interval values rounded up to five decimal places and separated by a space

#### Note:
•Margin of Error = Critical Value 

•Standard Error of Statistic•Confidence Interval = Sample Statistic ± Margin of Error

Example: Let's say 172 out of 200 customers were highly satisfied.
Sample Input:
172 

The confidence interval should be printed as 
Sample Output:0.82856 0.89144

In [1]:
from scipy import stats
from math import sqrt

In [2]:
stats.norm.ppf(.90)

1.2815515655446004

#### Read an integer input thatspecifies the number of highly satisfied customers

In [3]:
n =200
x = int(input("Please enter a number of happy cusomers: "))
p = x/n
print(p)

Please enter a number of happy cusomers: 172
0.86

#### Critical Value

In [4]:
# critical value
critical_value = stats.norm.ppf(.90)
print(critical_value)

1.2815515655446004

#### Standard Error of Statistic

In [5]:
se = sqrt((p*(1-p))/n)
print(se)

0.024535688292770596

#### Margin Error

In [6]:
# Margin error
ME = critical_value*se
print(ME)

0.03144374974331448

#### Confidence Interval

In [8]:
CI = (p+ME) , (p-ME)
print(CI)

(0.8914437497433144, 0.8285562502566856)

##### Problem Statement 2: 
#### A radar unit is used to measure the speeds of cars on a motorway. The speeds are normally distributed with a mean of 75 km/hr and a standard deviation of 15 km/hr.

Write a Python code to perform the following operations:

1.Find theprobability that a car picked at random is traveling at more thanXkm/hr

•Take the speed X as an input

•Printthe probability value rounded up tofour decimal places

In [1]:
import scipy.stats as st

In [2]:
u = 75 #normally distributed with a mean
o = 15 #standard deviation

x = int(input("Enter the value of x: "))

Enter the value of x: 100

In [3]:
z = (x - u)/o

In [4]:
a = st.norm.cdf(z)
#by the formula
b = 1 - a
b

0.047790352272814696

In [6]:
dst = 1 - a
ans = round(dst,4)
print("The probability that a car picked at random is travelling at more than ",x," km/hr is:", ans)

The probability that a car picked at random is travelling at more than  100  km/hr is: 0.0478

##### Problem Statement 3:

#### Write a Python program toload the “kerala.csv”data into a DataFrameand perform the following tasks:

1.Explore the DataFrame using info()and describe()functions

2.June and July are the peak months of rainfall. Consider that if it rains more than 500mm, then chances of flood become more;create a Datarame with columns –“YEAR”, “JUN_GT_500”(Contains a boolean value to showwhether it rained more than500 mm in the month of June), “JUL_GT_500”(Contains a boolean value to showwhether it rained more than500 mm in the month of July),and “FLOODS”(Containsaboolean value to showwhetherit flooded that year)

3.Calculate the probability of flood given it rained more than 500 mm in June (P(A|B))

4.Calculate the probability of rain more than 500 mm in June,given it flooded that year (P(B|A))

5.Probability of flood given it rained more than 500 mm in July

6.Probability of rainmore than 500 mm in July given it flooded that year (P(B|A))

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("kerala.csv")

In [3]:
df.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,YES
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,YES
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,YES
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,YES
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,NO

In [7]:
# Explore the DataFrame using info()and describe()functions
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118 entries, 0 to 117
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   SUBDIVISION       118 non-null    object
 1   YEAR              118 non-null    int64
 2   JAN               118 non-null    float64
 3   FEB               118 non-null    float64
 4   MAR               118 non-null    float64
 5   APR               118 non-null    float64
 6   MAY               118 non-null    float64
 7   JUN               118 non-null    float64
 8   JUL               118 non-null    float64
 9   AUG               118 non-null    float64
 10  SEP               118 non-null    float64
 11  OCT               118 non-null    float64
 12  NOV               118 non-null    float64
 13  DEC               118 non-null    float64
 14   ANNUAL RAINFALL  118 non-null    float64
 15  FLOODS            118 non-null    object
dtypes: float64(13), int64(1), object(2)
memory usage: 14.9+ KB

In [5]:
df.describe()

,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL
count,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000,118.000000
mean,1959.500000,12.218644,15.633898,36.670339,110.330508,228.644915,651.617797,698.220339,430.369492,246.207627,293.207627,162.311017,40.009322,2925.405085
std,34.207699,15.473766,16.406290,30.063862,44.633452,147.548778,186.181363,228.988966,181.980463,121.901131,93.705253,83.200485,36.676330,452.169407
min,1901.000000,0.000000,0.000000,0.100000,13.100000,53.400000,196.800000,167.500000,178.600000,41.300000,68.500000,31.500000,0.100000,2068.800000
25%,1930.250000,2.175000,4.700000,18.100000,74.350000,125.050000,535.550000,533.200000,316.725000,155.425000,222.125000,93.025000,10.350000,2613.525000
50%,1959.500000,5.800000,8.350000,28.400000,110.400000,184.600000,625.600000,691.650000,386.250000,223.550000,284.300000,152.450000,31.100000,2934.300000
75%,1988.750000,18.175000,21.400000,49.825000,136.450000,264.875000,786.975000,832.425000,500.100000,334.500000,355.150000,218.325000,54.025000,3170.400000
max,2018.000000,83.500000,79.000000,217.200000,238.000000,738.800000,1098.200000,1526.500000,1398.900000,526.700000,567.900000,365.600000,202.300000,4473.000000

In [9]:
'''June and July are the peak months of rainfall. Consider that if it rains more than 500mm,then chances of flood become more;create a Datarame with columns –“YEAR”, “JUN_GT_500”(Contains a boolean value to showwhether it rained more than500 mm in the month of June), “JUL_GT_500”(Contains a boolean value to showwhether it rained more than500 mm in the month of July),and “FLOODS”(Containsaboolean value to showwhetherit flooded that year'''

'June and July are the peak months of rainfall. Consider that if it rains more than 500mm,then chances of flood become more;create a Datarame with columns –“YEAR”, “JUN_GT_500”(Contains a boolean value to showwhether it rained more than500 mm in the month of June), “JUL_GT_500”(Contains a boolean value to showwhether it rained more than500 mm in the month of July),and “FLOODS”(Containsaboolean value to showwhetherit flooded that year'

In [10]:
df['June_gt_500'] = (df['JUN'] > 500).astype('int')
df['JUL_gt_500'] = (df['JUL'] > 500).astype('int')
df["FLOODS"] = df["FLOODS"].map({"YES": 1, "NO": 0})

In [11]:
df.head()

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS,June_gt_500,JUL_gt_500
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,1,1,1
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,1,0,1
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,1,1,1
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,1,1,1
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,0,1,1

In [12]:
df["JUN_GT_500"] = (df["JUN"] > 500).astype("int")
df["JUL_GT_500"] = (df["JUL"] > 500).astype("int")
df_small = df.loc[:, ["YEAR", "JUN_GT_500", "JUL_GT_500", "FLOODS"]]
df_small["COUNT"] = 1
df_small.head()

   YEAR  JUN_GT_500  JUL_GT_500  FLOODS  COUNT
0  1901           1           1       1      1
1  1902           0           1       1      1
2  1903           1           1       1      1
3  1904           1           1       1      1
4  1905           1           1       0      1

In [13]:
df_small.shape

(118, 5)

In [14]:
# Creating the tabular data based on the counts
pd.crosstab(df_small["FLOODS"], df_small["JUN_GT_500"])

JUN_GT_500   0   1
FLOODS
0           19  39
1            6  54

In [15]:
P_F = (6 + 54) / (6 + 54 + 19 + 39)
P_J = (39 + 54) / (6 + 54 + 19 + 39)
P_F_intersect_J = 54 / (6 + 54 + 19 + 39)
print(f"P(F): {P_F}") 
print(f"P(J): {P_J}")
print(f"P(F AND J): {P_F_intersect_J}")

P(F): 0.5084745762711864
P(J): 0.788135593220339
P(F AND J): 0.4576271186440678

In [16]:
# Now calculate probailitity of flood given it rained more than 500 mm in June (P(A|B))
P_F_J = P_F_intersect_J / P_J
print(f"P(F|J): {P_F_J}")

P(F|J): 0.5806451612903226

In [17]:
# Probability of rain more than 500 mm in June given it flooded that year (P(B|A))
P_J_F = (P_F_J * P_J) / P_F
print(f"P(J|F): {P_J_F}")

P(J|F): 0.9000000000000001

In [18]:
# We can similarly do it for july
pd.crosstab(df_small["FLOODS"], df_small["JUL_GT_500"])

JUL_GT_500   0   1
FLOODS
0           19  39
1            3  57

In [19]:
P_F = (3 + 57) / (3 + 57 + 19 + 39)
P_J = (39 + 57) / (3 + 57 + 19 + 39)
P_F_intersect_J = 57 / (3 + 57 + 19 + 39)
print(f"P(F): {P_F}") 
print(f"P(J): {P_J}")
print(f"P(F AND J): {P_F_intersect_J}")

P(F): 0.5084745762711864
P(J): 0.8135593220338984
P(F AND J): 0.4830508474576271

In [20]:
# Now calculate probailitity of flood given it rained more than 500 mm in July
P_F_J = P_F_intersect_J / P_J
print(f"P(F|J): {P_F_J}")

P(F|J): 0.59375

In [21]:
# Probability of rain more than 500 mm in July given it flooded that year (P(B|A))
P_J_F = (P_F_J * P_J) / P_F
print(f"P(J|F): {P_J_F}")

P(J|F): 0.9500000000000002

##### Problem Statement 4:

Write a Python program to load the wine dataset using the Sklearn library to a DataFrame and perform the following tasks:

1.Convert the datasetinto DataFrameusing pandas.

2.Generate the sample size of 50and givea randomstate as 100.

3.Calculate Z-critical, Margin of Error,andConfidence Interval for alcohol at 95% significance interval on generated sample data.

In [24]:
import numpy as np
import pandas as pd

In [25]:
from sklearn.datasets import load_wine

In [26]:
wine = load_wine()

In [27]:
# Convert the datasetinto DataFrameusing pandas
df = pd.DataFrame(data=wine.data, 
                  columns=wine.feature_names)

In [28]:
df.head()

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0
1,13.20,1.78,2.14,11.2,100.0,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050.0
2,13.16,2.36,2.67,18.6,101.0,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185.0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
4,13.24,2.59,2.87,21.0,118.0,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735.0

In [29]:
# Generate the sample size of 50and givea randomstate as 100.3
sample = df.sample(n=50,random_state=10)

In [31]:
# Calculate Z-critical, Margin of Error,andConfidence Interval for alcohol at 95% significance interval on generated sample data
import math
from scipy import stats
z_critical = stats.norm.ppf(q=0.95)

In [32]:
z_critical

1.6448536269514722

In [33]:
pop_std = sample['alcohol'].std()

In [34]:
pop_std

0.7768280875142328

In [35]:
sample_size = 50
margin_of_error = z_critical*(pop_std/math.sqrt(sample_size))

In [36]:
margin_of_error

0.1807037538406046

In [37]:
sample_mean = sample['alcohol'].mean()

In [38]:
sample_mean + margin_of_error, sample_mean - margin_of_error

(12.976303753840602, 12.614896246159391)